//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ДатаРожденияРавна(Парам01)","ДатаРожденияРавна","Допустим дата рождения равна 01.01.2016");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ДатаПроверкиРавна(Парам01)","ДатаПроверкиРавна","И дата проверки равна 01.12.2016");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"РезультатРасчетаРавенМесяцев(Парам01)","РезультатРасчетаРавенМесяцев","Тогда результат расчета равен 11 месяцев");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим дата рождения равна 01.01.2016
//@ДатаРожденияРавна(Парам01)
Процедура ДатаРожденияРавна(ДатаРождения) Экспорт
	Контекст.Вставить("ДатаРождения",ДатаРождения);	
КонецПроцедуры

&НаКлиенте
//И дата проверки равна 01.12.2016
//@ДатаПроверкиРавна(Парам01)
Процедура ДатаПроверкиРавна(ДатаПроверки) Экспорт
	Контекст.Вставить("ДатаПроверки",ДатаПроверки);
КонецПроцедуры

&НаКлиенте
//Тогда результат расчета равен 11 месяцев
//@РезультатРасчетаРавенМесяцев(Парам01)
Процедура РезультатРасчетаРавенМесяцев(ОжидаемыйРезультат) Экспорт
	Результат = ОбщийМодуль2.ПолучитьВозрастВМесяцахНаСервере(Контекст.ДатаРождения,Контекст.ДатаПроверки);
	Если Не ОжидаемыйРезультат = Результат Тогда
		ВызватьИсключение("Расчет возраста в месяцах - не верен. результат "+Результат+" ожидали "+ ОжидаемыйРезультат);
	КонецЕсли;
	
КонецПроцедуры

//окончание текста модуля