//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЕстьРабочаяПапкаОтчетаРавная(Парам01)","ЕстьРабочаяПапкаОтчетаРавная","Допустим есть рабочая папка отчета равная ""..\allure-report""");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВЭтойПапкеЕстьФайлыСРасширениемXml()","ВЭтойПапкеЕстьФайлыСРасширениемXml","И в этой папке есть файлы с расширением xml");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯЗапустилСкриптРавныйCreateAllureReportos()","ЯЗапустилСкриптРавныйCreateAllureReportos","И я запустил скрипт равный createAllureReport.os");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВПапкеОтчетаСозданаПапкаРавная(Парам01)","ВПапкеОтчетаСозданаПапкаРавная","Тогда в папке отчета создана папка равная ""allure-report""");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////


&НаКлиенте                                
//Допустим есть рабочая папка отчета равная "..\allure-report"
//@ЕстьРабочаяПапкаОтчетаРавная(Парам01)
Процедура ЕстьРабочаяПапкаОтчетаРавная(РабочийКаталог) Экспорт
	Каталог = Новый Файл(РабочийКаталог);
	Если НЕ Каталог.Существует() Тогда
		ВызватьИсключение ("Заданного каталога не существует");
	КонецЕсли;
	Контекст.Вставить("РабочийКаталог",РабочийКаталог);
КонецПроцедуры

&НаКлиенте
//И в этой папке есть файлы с расширением xml
//@ВЭтойПапкеЕстьФайлыСРасширениемXml()
Процедура ВЭтойПапкеЕстьФайлыСРасширениемXml() Экспорт
	Если НайтиФайлы(Контекст.РабочийКаталог,"*.xml").Количество() = 0 Тогда
		ВызватьИсключение("В рабочем каталоге нет xml файлов");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
//И я запустил скрипт равный createAllureReport.os
//@ЯЗапустилСкриптРавныйCreateAllureReportos()
Процедура ЯЗапустилСкриптРавныйCreateAllureReportos() Экспорт
	КомандаСистеме  = "oscript F:\repo\work2\createAllureReport.os";
	КомандаСистемы(КомандаСистеме,"F:\repo\work2\");	
КонецПроцедуры

&НаКлиенте
//Тогда в папке отчета создана папка равная "allure-report"
//@ВПапкеОтчетаСозданаПапкаРавная(Парам01)
Процедура ВПапкеОтчетаСозданаПапкаРавная(Парам01) Экспорт
	Каталог = Новый Файл(Контекст.РабочийКаталог+Парам01);
	Если НЕ Каталог.Существует() Тогда
		ВызватьИсключение ("Заданного каталога отчета не существует");
	КонецЕсли;
КонецПроцедуры

//окончание текста модуля