
Процедура ОсновныеДействияФормыОК(Кнопка)
	ВладелецФормы.ВыводитьТолькоИменаОбъектов = ВыводитьТолькоИменаОбъектов;	
	
	Для Каждого СтрокаДерева Из ДеревоЗначений.Строки Цикл
		Для Каждого Строка Из СтрокаДерева.Строки Цикл
			Если Строка.Родитель.ИмяОбъекта = Метаданные.Имя Тогда
				Поиск = ВладелецФормы.СписокОбъектов.НайтиПоЗначению(Строка.ИмяОбъекта);		
				Если Поиск <> Неопределено Тогда
					Поиск.Пометка = Строка.Пометка;
				КонецЕсли;
				Для Каждого Стр Из Строка.Строки Цикл
					Поиск = ВладелецФормы.СписокОбъектов.НайтиПоЗначению(Стр.ИмяОбъекта);		
					Если Поиск <> Неопределено Тогда
						Поиск.Пометка = Стр.Пометка;
					КонецЕсли;
				КонецЦикла;	
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;	
	
	Закрыть();
КонецПроцедуры

Процедура ДеревоЗначенийПриИзмененииФлажка(Элемент, Колонка)
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные.Родитель = Неопределено Тогда // это группа
		// проставим пометки для подчиненных строк
		Для Каждого Стр Из ТекДанные.Строки Цикл
			Стр.Пометка = ТекДанные.Пометка;
			Если Стр.Родитель.ИмяОбъекта = Метаданные.Имя Тогда 
				Для Каждого Строка Из Стр.Строки Цикл
					Строка.Пометка = ТекДанные.Пометка;
				КонецЦикла;
			КонецЕсли;				
		КонецЦикла;
	ИначеЕсли ТекДанные.Родитель.ИмяОбъекта = Метаданные.Имя Тогда
		Для Каждого Стр Из ТекДанные.Строки Цикл
			Стр.Пометка = ТекДанные.Пометка;			
		КонецЦикла;
	Иначе
		// если выбран подчиненный элемент, то нужно выбрать и родителя
		Если НЕ ТекДанные.Родитель.Пометка И ТекДанные.Пометка Тогда
			ТекДанные.Родитель.Пометка = Истина;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
